{
    "sdr": -4.77429204221003,
    "graph": {
        "format": "keras",
        "_type": "graph",
        "nodes": [
            {
                "output_shape": [
                    null,
                    257,
                    200,
                    2
                ],
                "id": "input_2",
                "name": "input_2",
                "class_name": "InputLayer",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    257,
                    2
                ],
                "id": "lambda",
                "name": "lambda",
                "class_name": "Lambda",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    257
                ],
                "id": "lambda_1",
                "name": "lambda_1",
                "class_name": "Lambda",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    257
                ],
                "id": "lambda_2",
                "name": "lambda_2",
                "class_name": "Lambda",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    514
                ],
                "id": "concatenate",
                "name": "concatenate",
                "class_name": "Concatenate",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d",
                "name": "conv1d",
                "class_name": "Conv1D",
                "num_parameters": 131840
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_5",
                "name": "conv1d_5",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_5",
                "name": "activation_5",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_10",
                "name": "batch_normalization_v1_10",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_5",
                "name": "separable_conv1d_5",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_6",
                "name": "activation_6",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_11",
                "name": "batch_normalization_v1_11",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_6",
                "name": "conv1d_6",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_13",
                "name": "add_13",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_7",
                "name": "conv1d_7",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_7",
                "name": "activation_7",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_12",
                "name": "batch_normalization_v1_12",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_6",
                "name": "separable_conv1d_6",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_8",
                "name": "activation_8",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_13",
                "name": "batch_normalization_v1_13",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_8",
                "name": "conv1d_8",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_14",
                "name": "add_14",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_9",
                "name": "conv1d_9",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_9",
                "name": "activation_9",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_14",
                "name": "batch_normalization_v1_14",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_7",
                "name": "separable_conv1d_7",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_10",
                "name": "activation_10",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_15",
                "name": "batch_normalization_v1_15",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_10",
                "name": "conv1d_10",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_15",
                "name": "add_15",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_11",
                "name": "conv1d_11",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_11",
                "name": "activation_11",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_16",
                "name": "batch_normalization_v1_16",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_8",
                "name": "separable_conv1d_8",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    50,
                    50,
                    100,
                    1
                ],
                "id": "frames_input",
                "name": "frames_input",
                "class_name": "InputLayer",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_12",
                "name": "activation_12",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    32,
                    32,
                    64
                ],
                "id": "sequential",
                "name": "sequential",
                "class_name": "Sequential",
                "num_parameters": 15936
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_17",
                "name": "batch_normalization_v1_17",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    32,
                    32,
                    64
                ],
                "id": "lambda2",
                "name": "lambda2",
                "class_name": "Lambda",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_12",
                "name": "conv1d_12",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    "multiple"
                ],
                "id": "model",
                "name": "model",
                "class_name": "Model",
                "num_parameters": 11378368
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_16",
                "name": "add_16",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    512
                ],
                "id": "global_avgpool_resnet",
                "name": "global_avgpool_resnet",
                "class_name": "GlobalAveragePooling2D",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_13",
                "name": "conv1d_13",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    256
                ],
                "id": "dense_2",
                "name": "dense_2",
                "class_name": "Dense",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_13",
                "name": "activation_13",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    256
                ],
                "id": "batch_normalization_v1_4",
                "name": "batch_normalization_v1_4",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 1024
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_18",
                "name": "batch_normalization_v1_18",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    256
                ],
                "id": "lambda6",
                "name": "lambda6",
                "class_name": "Lambda",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_9",
                "name": "separable_conv1d_9",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    50,
                    1024
                ],
                "id": "bidirectional",
                "name": "bidirectional",
                "class_name": "Bidirectional",
                "num_parameters": 2362368
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_14",
                "name": "activation_14",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    1024
                ],
                "id": "bidirectional_1",
                "name": "bidirectional_1",
                "class_name": "Bidirectional",
                "num_parameters": 4721664
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_19",
                "name": "batch_normalization_v1_19",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    29
                ],
                "id": "dense_3",
                "name": "dense_3",
                "class_name": "Dense",
                "num_parameters": 29725
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_14",
                "name": "conv1d_14",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    50,
                    128
                ],
                "id": "dense2",
                "name": "dense2",
                "class_name": "Dense",
                "num_parameters": 3840
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_17",
                "name": "add_17",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    256
                ],
                "id": "dense3",
                "name": "dense3",
                "class_name": "Dense",
                "num_parameters": 33024
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_15",
                "name": "conv1d_15",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "conv1d_3",
                "name": "conv1d_3",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_15",
                "name": "activation_15",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "activation",
                "name": "activation",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_20",
                "name": "batch_normalization_v1_20",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "batch_normalization_v1_5",
                "name": "batch_normalization_v1_5",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_10",
                "name": "separable_conv1d_10",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "separable_conv1d",
                "name": "separable_conv1d",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_16",
                "name": "activation_16",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "add_8",
                "name": "add_8",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_21",
                "name": "batch_normalization_v1_21",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "activation_1",
                "name": "activation_1",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_16",
                "name": "conv1d_16",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "batch_normalization_v1_6",
                "name": "batch_normalization_v1_6",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_18",
                "name": "add_18",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "separable_conv1d_1",
                "name": "separable_conv1d_1",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_17",
                "name": "conv1d_17",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "add_9",
                "name": "add_9",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_17",
                "name": "activation_17",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "activation_2",
                "name": "activation_2",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_22",
                "name": "batch_normalization_v1_22",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "batch_normalization_v1_7",
                "name": "batch_normalization_v1_7",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_11",
                "name": "separable_conv1d_11",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "separable_conv1d_2",
                "name": "separable_conv1d_2",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_18",
                "name": "activation_18",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "add_10",
                "name": "add_10",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_23",
                "name": "batch_normalization_v1_23",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "activation_3",
                "name": "activation_3",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_18",
                "name": "conv1d_18",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "batch_normalization_v1_8",
                "name": "batch_normalization_v1_8",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_19",
                "name": "add_19",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "separable_conv1d_3",
                "name": "separable_conv1d_3",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_19",
                "name": "conv1d_19",
                "class_name": "Conv1D",
                "num_parameters": 131584
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "add_11",
                "name": "add_11",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_19",
                "name": "activation_19",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "activation_4",
                "name": "activation_4",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_24",
                "name": "batch_normalization_v1_24",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "batch_normalization_v1_9",
                "name": "batch_normalization_v1_9",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_12",
                "name": "separable_conv1d_12",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "separable_conv1d_4",
                "name": "separable_conv1d_4",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_20",
                "name": "activation_20",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    50,
                    512
                ],
                "id": "add_12",
                "name": "add_12",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_25",
                "name": "batch_normalization_v1_25",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    50,
                    256
                ],
                "id": "conv1d_4",
                "name": "conv1d_4",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "conv1d_20",
                "name": "conv1d_20",
                "class_name": "Conv1D",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "up_sampling1d",
                "name": "up_sampling1d",
                "class_name": "UpSampling1D",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    256
                ],
                "id": "add_20",
                "name": "add_20",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    [
                        null,
                        200,
                        256
                    ],
                    [
                        null,
                        200,
                        200
                    ]
                ],
                "id": "attention_layer",
                "name": "attention_layer",
                "class_name": "AttentionLayer",
                "num_parameters": 131328
            },
            {
                "output_shape": [
                    null,
                    200,
                    768
                ],
                "id": "concatenate_1",
                "name": "concatenate_1",
                "class_name": "Concatenate",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_21",
                "name": "conv1d_21",
                "class_name": "Conv1D",
                "num_parameters": 393728
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_22",
                "name": "conv1d_22",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_21",
                "name": "activation_21",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_26",
                "name": "batch_normalization_v1_26",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_13",
                "name": "separable_conv1d_13",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_21",
                "name": "add_21",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_23",
                "name": "conv1d_23",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_22",
                "name": "activation_22",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_27",
                "name": "batch_normalization_v1_27",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_14",
                "name": "separable_conv1d_14",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_22",
                "name": "add_22",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_24",
                "name": "conv1d_24",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_23",
                "name": "activation_23",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_28",
                "name": "batch_normalization_v1_28",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_15",
                "name": "separable_conv1d_15",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_23",
                "name": "add_23",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_25",
                "name": "conv1d_25",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_24",
                "name": "activation_24",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_29",
                "name": "batch_normalization_v1_29",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_16",
                "name": "separable_conv1d_16",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_24",
                "name": "add_24",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_26",
                "name": "conv1d_26",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_25",
                "name": "activation_25",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_30",
                "name": "batch_normalization_v1_30",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_17",
                "name": "separable_conv1d_17",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_25",
                "name": "add_25",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_27",
                "name": "conv1d_27",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_26",
                "name": "activation_26",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_31",
                "name": "batch_normalization_v1_31",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_18",
                "name": "separable_conv1d_18",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_26",
                "name": "add_26",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_28",
                "name": "conv1d_28",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_27",
                "name": "activation_27",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_32",
                "name": "batch_normalization_v1_32",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_19",
                "name": "separable_conv1d_19",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_27",
                "name": "add_27",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_29",
                "name": "conv1d_29",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_28",
                "name": "activation_28",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_33",
                "name": "batch_normalization_v1_33",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "separable_conv1d_20",
                "name": "separable_conv1d_20",
                "class_name": "SeparableConv1D",
                "num_parameters": 264192
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "add_28",
                "name": "add_28",
                "class_name": "Add",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_30",
                "name": "conv1d_30",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "conv1d_38",
                "name": "conv1d_38",
                "class_name": "Conv1D",
                "num_parameters": 262656
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_29",
                "name": "activation_29",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "activation_37",
                "name": "activation_37",
                "class_name": "Activation",
                "num_parameters": 0
            },
            {
                "output_shape": [
                    null,
                    200,
                    512
                ],
                "id": "batch_normalization_v1_34",
                "name": "batch_normalization_v1_34",
                "class_name": "BatchNormalizationV1",
                "num_parameters": 2048
            },
            {
                "output_shape": [
                    null,
